title: Detect Activity to Known Malicious Indicator - http://14.236.120.74/sshd
id: auto-ea38d8ee69e9f3209c23ef9036e2ee9d750c642785bc31d05e8535b96dec2f39
status: experimental
description: Detects traffic or activity related to http://14.236.120.74/sshd which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*http://14.236.120.74/sshd*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
