title: Detect Activity to Known Malicious Indicator - http://216.126.224.115/02.08.2022.exe
id: auto-486954fe836aa9e116674ae66dee3ca5be8dcff0ab44180385095eff96d29f8f
status: experimental
description: Detects traffic or activity related to http://216.126.224.115/02.08.2022.exe which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*http://216.126.224.115/02.08.2022.exe*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
