title: Detect Activity to Known Malicious Indicator - 5e884898da28047151d0e56f8dc6292773603d0d6aabbdd62a11ef721d1542d8
id: auto-113459eb7bb31bddee85ade5230d6ad5d8b2fb52879e00a84ff6ae1067a210d3
status: experimental
description: Detects traffic or activity related to 5e884898da28047151d0e56f8dc6292773603d0d6aabbdd62a11ef721d1542d8 which is a known malicious hash.
logsource:
  category: process_creation
detection:
  selection:
    hashes:
      - '*5e884898da28047151d0e56f8dc6292773603d0d6aabbdd62a11ef721d1542d8*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.MalwareBazaar
