title: Detect Activity to Known Malicious Indicator - http://31.104.231.65:82/sshd
id: auto-4ca993d21f93088be41d646f9985610157b51b35ecfd250a69e60f98a56b4318
status: experimental
description: Detects traffic or activity related to http://31.104.231.65:82/sshd which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*http://31.104.231.65:82/sshd*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
