title: Detect Activity to Known Malicious Indicator - http://47.84.116.153:8080/02.08.2022.exe
id: auto-0ebb1b72357185732a950368d34025a2cc25a7fb9e00c7a42299f3aef097c858
status: experimental
description: Detects traffic or activity related to http://47.84.116.153:8080/02.08.2022.exe which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*http://47.84.116.153:8080/02.08.2022.exe*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
