title: Detect Activity to Known Malicious Indicator - https://brisk.v0xletrill.ru/2k2q99fb
id: auto-ca4dcc94349fc09773048bc82739df0cb6411ee99d5b55ea59c1ab8216b9cca6
status: experimental
description: Detects traffic or activity related to https://brisk.v0xletrill.ru/2k2q99fb which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*https://brisk.v0xletrill.ru/2k2q99fb*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
