title: Detect Activity to Known Malicious Indicator - http://91.80.165.24/sshd
id: auto-a48de9d9442b6628c5fdd8a37ae79e48af10623061aabb066e44e6cbaa7d6965
status: experimental
description: Detects traffic or activity related to http://91.80.165.24/sshd which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*http://91.80.165.24/sshd*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
