title: Detect Activity to Known Malicious Indicator - https://fuzz.muddle-oak.ru/if38ivij
id: auto-aa9fb13021562b9033071274a04847b85e750dd0a844d5764d60a11dfef42435
status: experimental
description: Detects traffic or activity related to https://fuzz.muddle-oak.ru/if38ivij which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*https://fuzz.muddle-oak.ru/if38ivij*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
