title: Detect Activity to Known Malicious Indicator - https://nova.pincer-loom.ru/7r7fmgp5
id: auto-711b529abbaef23e7a65368d6baf41f5fbf8851ba25588c983bc90f8b2ed6a57
status: experimental
description: Detects traffic or activity related to https://nova.pincer-loom.ru/7r7fmgp5 which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*https://nova.pincer-loom.ru/7r7fmgp5*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
