title: Detect Activity to Known Malicious Indicator - http://14.168.103.160:8082/sshd
id: auto-440a3fcb6126f0f9e2237a87ec1ba7344a5582cd5a6749b443f0fb78755e3953
status: experimental
description: Detects traffic or activity related to http://14.168.103.160:8082/sshd which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*http://14.168.103.160:8082/sshd*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
