title: Detect Activity to Known Malicious Indicator - malicious-example.com
id: auto-0c021e2cae67c1a6a6efc9d1d57f809691466352e7d6b1b0cd7d0ffa12413df0
status: experimental
description: Detects traffic or activity related to malicious-example.com which is a known malicious domain.
logsource:
  category: dns
detection:
  selection:
    query:
      - '*malicious-example.com*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.OTX
