title: Detect Activity to Known Malicious Indicator - https://fuzz.muddle-oak.ru/vuvz84l6
id: auto-41520393c5a58d669f2c92c1047769a3b4be95c1dbbe08d62b424d9f5109448c
status: experimental
description: Detects traffic or activity related to https://fuzz.muddle-oak.ru/vuvz84l6 which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*https://fuzz.muddle-oak.ru/vuvz84l6*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
