title: Detect Activity to Known Malicious Indicator - https://www.azulwork.com/impact/example.mp4
id: auto-075b4f261d05fc83c5faada080c86a7dae5d1f04254c4d1ec3f0e097beb7f5d9
status: experimental
description: Detects traffic or activity related to https://www.azulwork.com/impact/example.mp4 which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*https://www.azulwork.com/impact/example.mp4*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
