title: Detect Activity to Known Malicious Indicator - http://31.104.231.65:81/sshd
id: auto-5cfbfe085c8abf95432af90ed1316ca6e1fccca0c8e52034ae950e2f2e4938b2
status: experimental
description: Detects traffic or activity related to http://31.104.231.65:81/sshd which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*http://31.104.231.65:81/sshd*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
