title: Detect Activity to Known Malicious Indicator - https://trill.v0xletrill.ru/ujdd10oh
id: auto-b58c475092fb1dc4aff1c76bd9469495ab1612c8a8c2195e3bf0ffe225d01b1e
status: experimental
description: Detects traffic or activity related to https://trill.v0xletrill.ru/ujdd10oh which is a known malicious url.
logsource:
  category: proxy
detection:
  selection:
    c-uri:
      - '*https://trill.v0xletrill.ru/ujdd10oh*'
  condition: selection
level: high
tags:
  - attack.t1071
  - source.URLhaus
